app/controllers/blocks_controller.rb

  def index
    if Block.chain.length === 0
---
SELECT "blocks".* FROM "blocks"

  def new
    Block.addBlock(Block.chain[Block.chain.size - 1])
---
SELECT "blocks".* FROM "blocks"
SELECT COUNT(*) FROM "blocks"